#### creating the dataframe

In [3]:
import pandas as pd

data = [[1,'alisha','female',43,47,41],[2,'anne','female',44,47,49],[3,'bunny','male',39,44,41],[4,'clara','female',33,48,49],[5,'durjoy','male',43,47,41],[6,'firoz','male',43,47,48],[7,'harmanpreet','female',43,49,41],[8,'jack','male',40,47,41],[9,'keith','male',50,50,49],[10,'manish','male',43,37,41]]
df = pd.DataFrame(data, columns=['roll no.','name','gender','marks1','marks2','marks3'])

In [4]:
df

   roll no.         name  gender  marks1  marks2  marks3
0         1       alisha  female      43      47      41
1         2         anne  female      44      47      49
2         3        bunny    male      39      44      41
3         4        clara  female      33      48      49
4         5       durjoy    male      43      47      41
5         6        firoz    male      43      47      48
6         7  harmanpreet  female      43      49      41
7         8         jack    male      40      47      41
8         9        keith    male      50      50      49
9        10       manish    male      43      37      41

#### 1. creating a new column with total marks

In [5]:
df['total']=df['marks1']+df['marks2']+df['marks3']

In [6]:
df

   roll no.         name  gender  marks1  marks2  marks3  total
0         1       alisha  female      43      47      41    131
1         2         anne  female      44      47      49    140
2         3        bunny    male      39      44      41    124
3         4        clara  female      33      48      49    130
4         5       durjoy    male      43      47      41    131
5         6        firoz    male      43      47      48    138
6         7  harmanpreet  female      43      49      41    133
7         8         jack    male      40      47      41    128
8         9        keith    male      50      50      49    149
9        10       manish    male      43      37      41    121

#### finding lowest marks in marks1

In [7]:
df['marks1'].min()

33

#### finding highest marks in marks2

In [8]:
df['marks2'].max()

50

#### finding average marks in marks3

In [11]:
df['marks3'].mean()

44.1

#### finding student name with highest average

In [23]:
avg = df.groupby('name')['total'].mean()

In [24]:
df

   roll no.         name  gender  marks1  marks2  marks3  total  averagemarks
0         1       alisha  female      43      47      41    131     43.666667
1         2         anne  female      44      47      49    140     46.666667
2         3        bunny    male      39      44      41    124     41.333333
3         4        clara  female      33      48      49    130     43.333333
4         5       durjoy    male      43      47      41    131     43.666667
5         6        firoz    male      43      47      48    138     46.000000
6         7  harmanpreet  female      43      49      41    133     44.333333
7         8         jack    male      40      47      41    128     42.666667
8         9        keith    male      50      50      49    149     49.666667
9        10       manish    male      43      37      41    121     40.333333

In [26]:
topper=avg.idxmax()

In [27]:
topper

'keith'

#### how many students failed in marks2 ie <40

In [28]:
failed = df[df['marks2'] < 40]
numofstudents=failed['name'].nunique()

In [29]:
numofstudents

1

####  creating a table with the 5-number summary of all the numeric attributes

In [32]:
five_number_summary = df.describe()
print("\n5-Number Summary:\n", five_number_summary)

5-Number Summary:
        roll no.     marks1     marks2     marks3       total
count  10.00000  10.000000  10.000000  10.000000   10.000000
mean    5.50000  42.100000  46.300000  44.100000  132.500000
std     3.02765   4.306326   3.622461   4.012481    8.127457
min     1.00000  33.000000  37.000000  41.000000  121.000000
25%     3.25000  40.750000  47.000000  41.000000  128.500000
50%     5.50000  43.000000  47.000000  41.000000  131.000000
75%     7.75000  43.000000  47.750000  48.750000  136.750000
max    10.00000  50.000000  50.000000  49.000000  149.000000